{
  "basics": {
    "name": "Jason Roebuck",
    "label": "Software Engineer, Full-stack Web Developer",
    "picture": "http://www.roebuckgis.com/headshot.jpg",
    "email": "jtroe@me.com",
    "phone": "(208) 546-9276",
    "summary": "I'm passionate about life-long learning, and making technology work for people.",
    "location": {
      "address": "414 West Ashby Drive",
      "postalCode": "ID 83646",
      "city": "Meridian",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jtroe",
        "url": "http://github.com/jtroe"
      },
      {
        "network": "LinkedIn",
        "username": "jtroebuck",
        "url": "http://linkedin.com/in/jtroebuck"
      }
    ]
  },
  "work": [
    {
      "company": "Resource Data, Inc.",
      "position": "Senior Programmer/Analyst (GIS)",
      "website": "https://www.resdat.com",
      "startDate": "2012-12-03",
      "summary": "I develop successful custom business solutions using industry best-practices, many using Geospatial technology",
      "highlights": [
        "Developer at Idaho Power Company modernizing legacy internal applications using a new .NET Core MVC and WebAPI framework.",
        "Developer, Geospatial Lead for AlertSense from April 2016; Designed and implemented geofencing capability for alert triggering, display and management of customer geospatial data including asset and user locations; contributed as a member of an agile full-stack development team.",
        "Technical Lead at J.R. Simplot Company's corporate GIS efforts from March 2015-February 2016; successfully upgraded corporate GIS infrastructure; coordinated upgrade effort across multiple teams to ensure required applications updated in sync; implemented Portal for ArcGIS across Enterrpise; Rewrote legacy application directory (Silverlight) as Angular 1.4.x app as pilot and proof-of-concept; Architected and built automated aerial imagery processing solution replacing a collection of manually coordinated scripts.",
        "Technical Lead for Alaska Gasline Development Corporation GIS Division from January 2013 through May 2015; developed and maintained custom GIS web portal which provides access to webmaps and metadata from Enterprise GIS infrastructure; directed infrastructure team in proper maintenance of GIS assets; provided recommendations to business; utilized and enforced industry standards for data governance and development workflows."
      ]
    },
    {
      "company": "City of Auburn",
      "position": "Programmer/Analyst (GIS)",
      "website": "http://www.auburnalabama.org",
      "startDate": "2012-01-01",
      "endDate": "2012-11-30",
      "summary": "Chiefly responsible for city's interactive mapping applications. Led development of a new general-purpose, public-facing web application.  Developed new data-driven enterprise mapping application for water quality data management, replacing a legacy spreadsheet workflow with multiple potential points of failure and lack of organizational transparency."
    },
    {
      "company": "Alexander City, Public Works",
      "position": "GIS Coordinator",
      "website": "http://www.alexandercityonline.com",
      "startDate": "2011-04-01",
      "endDate": "2012-02-15",
      "summary": "Responsible for city-wide GIS infrastructure, data management, and policy. Successfully led campaign to organize City's Information Technology department. Instrumental in making key design decisions. Laid foundation for city's eventual adoption of enterprise GIS."
    },
    {
      "company": "BYU Harold B. Lee Library",
      "position": "GIS Specialist",
      "website": "http://lib.byu.edu/",
      "startDate": "2010-03-01",
      "endDate": "2011-04-01",
      "summary": "Researched, designed, and prototyped implementation of ArcGIS Enterprise platform for library-wide use. Worked directly with Geospatial Librarian to gather requirements for implementation."
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "C#.NET",
        "Ruby",
        "Python",
        "HTML",
        "XAML",
        "JavaScript",
        "TypeScript",
        "Powershell",
        "T-SQL",
        "Java"
      ]
    },
    {
      "name": "Operations / Administration",
      "keywords": [
        "Jenkins CI",
        "Git/GitHub",
        "VSTS",
        "Microsoft SQL Server",
        "Windows Server",
        "Azure",
        "AWS",
        "Rake"
      ]
    },
    {
      "name": "Frameworks / Libraries",
      "keywords": [
        "Angular",
        "Knockout",
        "jQuery",
        "Bootstrap",
        "NUnit",
        "Moq",
        "Leaflet"
      ]
    },
    {
      "name": "Other Concepts",
      "keywords": [
        "CSS",
        "Database Design/Development",
        "MVC/WebAPI",
        "ESRI ArcGIS Platform",
        "Visual Studio",
        "Software Licensing"
      ]
    }
  ],
  "education": [
    {
      "institution": "Brigham Young University",
      "area": "Geography, Geographic Information Systems",
      "studyType": "Bachelor of Science",
      "endDate": "2011-04-01"
    }
  ]
}